Import Pndas module

In [1]:
import pandas as pd

Load CSV File

In [3]:
dataset = pd.read_csv("Data.csv")
dataset.head()

      Name  Roll No      City  Marks
0    Zaid         1     Dhule     75
1     Zaki        2  Malegaon     77
2  Sufiyan        3  Malegaon     80
3     Umer        4   Jalgaon     65
4     Alim        5    Nashik     67

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Roll No  10 non-null     int64
 2   City     10 non-null     object
 3   Marks    10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [5]:
dataset.describe()

        Roll No      Marks
count  10.00000  10.000000
mean    5.50000  73.000000
std     3.02765   6.429101
min     1.00000  65.000000
25%     3.25000  67.750000
50%     5.50000  72.500000
75%     7.75000  76.500000
max    10.00000  85.000000

In [7]:
dataset["Marks"]

0    75
1    77
2    80
3    65
4    67
5    73
6    85
7    70
8    66
9    72
Name: Marks, dtype: int64